In [38]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

np.random.seed(0)

In [39]:
# [문제1]
# insurance.csv'파일 읽어서 df에 할당하고, 상위 5개 항목 출력하기
df = pd.read_csv('./data/insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [40]:
#[문제2]
# df의 요약(평균, 4분위수, 전체 갯수 등)정보 확인하기
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [41]:
#[문제3]
# 신규 컬럼(double bmi)을 생성하고, bmi의 2배가 되는 값을 할당하기
df['double bmi'] = df['bmi'] *2

In [42]:
# [문제4]
# 신규 컬럼(debt)을 생성하고, 0으로 채우기
df['debt'] = 0

In [43]:
#[문제5]
# debt에 0부터 값이 증가하도록 채우기
df['debt'] = range(len(df))

In [44]:
#[문제6]
# 1번 인덱스의 정보 출력
df.iloc[0]

age                  19
sex              female
bmi                27.9
children              0
smoker              yes
region        southwest
charges       16884.924
double bmi         55.8
debt                  0
Name: 0, dtype: object

In [45]:
# [문제7]
# 'double bmi'열 삭제하기
df.drop(df.columns[7], axis=1, inplace=True)

In [46]:
#[문제8]
# 'age'열, 'sex'열만 출력하기
# df['age']
# df['sex']
df [['age','sex']]

      age     sex
0      19  female
1      18    male
2      28    male
3      33    male
4      32    male
...   ...     ...
1333   50    male
1334   18  female
1335   18  female
1336   21  female
1337   61  female

[1338 rows x 2 columns]

In [47]:
#[문제9]
# 나이를 1살씩 증가시키기
df['age'] = df['age'] +1

In [48]:
# [문제10]
# charges의 표시형식을 소수점 아래 2자리로 바꾸기
df['charges'] = df['charges'].round(2)

In [ ]:
# [문제11]
# 컬럼 정렬(알파벳 순서대로) : age, bmi, charges... 순으로 정렬
df.sort_index(axis=1, inplace=True)

In [78]:
# [문제12]
# 값 정렬(age) : 나이 순으로 정렬
df.sort_values(by='age', ascending= False, inplace=True )

In [84]:
# [문제13]
# 나이('age') 평균구하기
print(df['age'].mean())

40.20702541106129

In [79]:
df.head()

      age     bmi   charges  children  debt     region     sex smoker
1265   65  23.760  26926.51         0  1265  southeast    male    yes
1241   65  36.960  49577.66         2  1241  southeast    male    yes
752    65  37.905  14210.54         0   752  northwest    male     no
768    65  39.700  14319.03         0   768  southwest  female     no
825    65  31.825  16069.08         2   825  northeast  female     no

In [ ]:
# [문제14]
# 보험료('charges')와 가장 상관관계가 높은 변수는?
df

In [54]:
# [문제15]
# 남자, 여자가 각각 몇명있는지 구하기

In [55]:
# [문제16]
# 자녀(children)가 3명인 데이터 출력하기

In [56]:
# [문제16]
# 자녀(children)가 5명 이상인 데이터 출력하기

In [57]:
# [문제17]
# bmi가 17 미만인 데이터 출력하기

In [58]:
# [문제18]
# 성별에 따른 보험료 평균

In [59]:
# [문제19]
# 흡연여부에 따른 보험료 평균

In [60]:
# [문제20]
# 지역별 보험료 평균

In [61]:
# [문제21]
# 흡연여부 + 지역별 데이터 평균

In [62]:
# [문제22]
# 흡연여부 + 지역별 데이터 평균에서 'charges' 만 츨력하기

In [63]:
# [문제23]
# 흡연여부 + 지역별 데이터 크기(size)

In [64]:
# [문제24]
# smoker 여부에 따라, group_val 컬럼에 '흡연자', '비흡연자' 표시하기